am/OpenFOAM-10/tutorials/multiphase/multiphaseInterFoam/RAS/damBreak4phase/0/alpha.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            alphaContactAngle;
        contactAngleProperties
        {
            air             { theta0 90; }
            oil             { theta0 90; }
            mercury         { theta0 90; }
        }
        value           uniform 0;
    }
    rightWall
    {
        type            alphaContactAngle;
        contactAngleProperties
        {
            air             { theta0 90; }
            oil             { theta0 90; }
            mercury         { theta0 90; }
        }
        value           uniform 0;
    }
    lowerWall
    {
        type            alphaContactAngle;
        contactAngleProperties
        {
            air             { theta0 90; }
            oil             { theta0 90; }
            mercury         { theta0 90; }
        }
        value           uniform 0;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
